In [41]:
import pandas
pandas.__version__

'0.23.1'

In [42]:
import pandas as pd

In [43]:
pd?

pd.<TAB\>

In [44]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

#### The Pandas series object

In [45]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [46]:
data.values
data.index

array([0.25, 0.5 , 0.75, 1.  ])

RangeIndex(start=0, stop=4, step=1)

In [47]:
data[1]
data[1:3]

0.5

1    0.50
2    0.75
dtype: float64

In [48]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd']) #creation by applying index
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [49]:
data['b']

0.5

In [50]:
data = pd.Series([23,45,6,7], index = [2,3,5,7])
data

2    23
3    45
5     6
7     7
dtype: int64

In [51]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135} #creating series by single dictionary

population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [52]:
population['California' : 'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

In [53]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [54]:
pd.Series({2:'a', 1:'b', 3:'c'})

1    b
2    a
3    c
dtype: object

In [55]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [56]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [57]:
states.index
states.values
states.columns

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

array([[  423967, 38332521],
       [  170312, 19552860],
       [  149995, 12882135],
       [  141297, 19651127],
       [  695662, 26448193]])

Index(['area', 'population'], dtype='object')

In [58]:
states['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

### Constructing DataFrame objects

#### From a single series object

In [71]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

In [72]:
pd.DataFrame(area, columns=['area'])

              area
California  423967
Florida     170312
Illinois    149995
New York    141297
Texas       695662

#### From list of dictionary object

In [64]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [65]:

pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

#### From a dictionary of series object

In [66]:
pd.DataFrame({'population': population,
              'area': area})#here population and area both are series objects

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

#### From a two-dimensional NumPy array

In [76]:
import numpy as np

In [77]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.617056  0.685829
b  0.906268  0.135156
c  0.411145  0.775273

#### From numpy structured array

In [78]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [79]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [80]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [81]:
ind[1]

3

In [85]:

ind[::2] # can act as normal array

Int64Index([2, 5, 11], dtype='int64')

In [86]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [87]:
ind[1] = 0 #indicex are immutale

TypeError: Index does not support mutable operations

In [88]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [89]:
indA & indB  # intersection

Int64Index([3, 5, 7], dtype='int64')

In [90]:

indA | indB  # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [91]:
indA ^ indB  # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

In [97]:

import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])

'a' in data
data.keys()
data.index
data.items() #return a zip
list(data.items())

True

Index(['a', 'b', 'c', 'd'], dtype='object')

Index(['a', 'b', 'c', 'd'], dtype='object')

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

As you can extend a dict by adding a keys, similarly we can extend data frame

In [99]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [100]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [101]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [102]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [103]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

#### Indexers: loc, iloc, and ix

In [104]:
data = pd.Series(['a', 'b' ,'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [105]:
# explicit index when indexing
data[1]

'a'

In [106]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the Series.

First, the loc attribute allows indexing and slicing that always references the explicit index:

In [109]:
data.loc[1] #it may have any data type as index depends on the definition

'a'

In [108]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit Python-style index:

In [110]:
data.iloc[1]#iloc always have because implicit indexing

'b'

In [111]:
data.iloc[1:3]

3    b
5    c
dtype: object


#### Data Selection in DataFrame
Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index. These analogies can be helpful to keep in mind as we explore data selection within this structure.

In [316]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [318]:
data['area'] #better to use this because column name may have spaces 
data.area #in R it is written as data$area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

Though this is a useful shorthand(data.area), keep in mind that it does not work for all cases! For example, if the column names are not strings, or if the column names conflict with methods of the DataFrame, this attribute-style access is not possible. For example, the  DataFrame has a pop() method, so data.pop will point to this rather than the "pop" column:

In [319]:
data['density'] = data['pop'] / data['area'] #adding a column to the data frame
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [320]:
data.values #just two dimensional array

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01]])

In [321]:
data.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [322]:
data.columns

Index(['area', 'pop', 'density'], dtype='object')

In [323]:
data.T #transposing the full data frame swapping the row and column

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

In [324]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [325]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [326]:
data.iloc[:3,:2] #implicit indexing i.e position based indexing

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [327]:
data.loc[:'Illinois', :'pop'] #explicit indexing i.e label based indexing

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

###### The ix indexer allows a hybrid of these two approaches:

In [328]:
data.ix[:3, :'pop'] #.ix is depricated

/home/abhash/.local/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [329]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [330]:
k = data[data['density'] > 100]

k

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

In [331]:
k.columns

Index(['area', 'pop', 'density'], dtype='object')

In [332]:
k.loc[:,['pop','density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [333]:
(data[data['density'] > 100]).loc[:,['pop','density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [334]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [335]:
data.ix[data['density'] > 100,[1,2]]

/home/abhash/.local/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [336]:
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [337]:
data.iloc[:,2] > 100

California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [338]:
data.iloc[data.iloc[:,2].values > 100, 1:]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [339]:
data['density'] > 100

California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [340]:
data.iloc[data['density'].values > 100, 1:]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [341]:
data.loc[data['density'].values > 100, 'pop':]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [342]:
data.loc[data.loc[:,'density']> 100 , 'pop':]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [343]:
data.loc[:,'density'] > 100

California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [344]:
data['Florida':'Illinois'] #only rows can be accessed in this way

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [345]:
data.loc[:,'pop':'density']#for accessing columns with all rows use loc

                 pop     density
California  38332521   90.000000
Florida     19552860  114.806121
Illinois    12882135   85.883763
New York    19651127  139.076746
Texas       26448193   38.018740

In [346]:
data[1:3] #only refers to rows, return all columns

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [347]:
data[data.density > 100] #return all rows having density > 100

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

In [348]:
data[data.density > 100].loc[:,'pop':]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [349]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [350]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D']) #index formed implicitly
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [351]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [352]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [353]:
df * 2

    A   B   C   D
0  12  18   4  12
1  14   8   6  14
2  14   4  10   8

In [354]:

area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [355]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

The resulting array contains the union of indices of the two input arrays, which could be determined using standard Python set arithmetic on these indices:

In [356]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

Any item for which one or the other does not have an entry is marked with NaN, or "Not a Number," which is how Pandas marks missing data (see further discussion of missing data in Handling Missing Data). This index matching is implemented this way for any of Python's built-in arithmetic expressions; any missing values are filled in with NaN by default:

In [357]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

If using NaN values is not the desired behavior, the fill value can be modified using appropriate object methods in place of the operators. For example, calling A.add(B) is equivalent to calling A + B, but allows optional explicit specification of the fill value for any elements in A or B that might be missing:

In [358]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [359]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [360]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [361]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [362]:
np.mean(A.loc[:,'A'])
A.stack()

3.0

0  A     1
   B    11
1  A     5
   B     1
dtype: int64

In [363]:
A.stack().mean()

4.5

In [364]:
A.stack?

In [365]:
np.sum(A.values)/ A.values.size

4.5

In [366]:
np.sum(A)# ufunc applied but keeping index in consideration
#think the difference from the sum computed in the above cell(it adds all records)

A     6
B    12
dtype: int64

In [367]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

<table>
<thead>
<tr>
<th>Python Operator</th>
<th>Pandas Method(s)</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>+</code></td>
<td><code>add()</code></td>
</tr>
<tr>
<td><code>-</code></td>
<td>
<code>sub()</code>, <code>subtract()</code>
</td>
</tr>
<tr>
<td><code>*</code></td>
<td>
<code>mul()</code>, <code>multiply()</code>
</td>
</tr>
<tr>
<td><code>/</code></td>
<td>
<code>truediv()</code>, <code>div()</code>, <code>divide()</code>
</td>
</tr>
<tr>
<td><code>//</code></td>
<td><code>floordiv()</code></td>
</tr>
<tr>
<td><code>%</code></td>
<td><code>mod()</code></td>
</tr>
<tr>
<td><code>**</code></td>
<td><code>pow()</code></td>
</tr>
</tbody>
</table>

#### Operations Between DataFrame and Series

When performing operations between a DataFrame and a Series, the index and column alignment is similarly maintained. Operations between a DataFrame and a Series are similar to operations between a two-dimensional and one-dimensional NumPy array. Consider one common operation, where we find the difference of a two-dimensional array and one of its rows:

In [368]:
A = rng.randint(10, size=(3, 4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [369]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [370]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]# selecting row for selecting col use [:,0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [371]:
df.subtract(df['R'], axis=0) #if you want to work on columns

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

Note that these DataFrame/Series operations, like the operations discussed above, will automatically align indices between the two elements:

In [372]:
halfrow = df.iloc[0, ::2] #selecting alternalte columns
halfrow

Q    3
S    2
Name: 0, dtype: int64

#### Handling missing Data

There are a number of schemes that have been developed to indicate the presence of missing data in a table or DataFrame. Generally, they revolve around one of two strategies: using a mask that globally indicates missing values, or choosing a sentinel value that indicates a missing entry.

#### missing value in Pandas

Pandas chose to use sentinels for missing data, and further chose to use two already-existing Python null values: the special floating-point NaN value, and the Python None object.

#### None : Pythonic missing data

The first sentinel value used by Pandas is None, a Python singleton object that is often used for missing data in Python code. Because it is a Python object, None cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type 'object' (i.e., arrays of Python objects):

In [373]:
import numpy as np
import pandas as pd

In [374]:
vals1 = np.array([1,None,3,4])
vals1

array([1, None, 3, 4], dtype=object)


This dtype=object means that the best common type representation NumPy could infer for the contents of the array is that they are Python objects. While this kind of object array is useful for some purposes, any operations on the data will be done at the Python level, with much more overhead than the typically fast operations seen for arrays with native types:

In [375]:
#problem with python object
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### NaN : Missing numerical data

The other missing data representation, NaN (acronym for Not a Number), is different; it is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation:

In [376]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [377]:
np.cumsum(vals2)# think about the result

array([ 1., nan, nan, nan])

In [378]:
vals2.sum(), vals2.min(), vals2.max()

/home/abhash/.local/lib/python3.5/site-packages/numpy/core/_methods.py:29: RuntimeWarning: invalid value encountered in reduce
  return umr_minimum(a, axis, None, out, keepdims)
/home/abhash/.local/lib/python3.5/site-packages/numpy/core/_methods.py:26: RuntimeWarning: invalid value encountered in reduce
  return umr_maximum(a, axis, None, out, keepdims)

(nan, nan, nan)

NumPy does provide some special aggregations that will ignore these missing values:

In [379]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [380]:
np.nancumsum(vals2)

array([1., 1., 4., 8.])

Keep in mind that NaN is specifically a floating-point value; there is no equivalent NaN value for integers, strings, or other types.

#### NaN and None in Pandas

NaN and None both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [381]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don't have an available sentinel value, Pandas automatically type-casts when NA values are present. For example, if we set a value in an integer array to np.nan, it will automatically be upcast to a floating-point type to accommodate the NA:

In [382]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [383]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

Notice that in addition to casting the integer array to floating point, Pandas automatically converts the None to a NaN value. (Be aware that there is a proposal to add a native integer NA to Pandas in the future; as of this writing, it has not been included).

<table>
<thead>
<tr>
<th>Typeclass</th>
<th>Conversion When Storing NAs</th>
<th>NA Sentinel Value</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>floating</code></td>
<td>No change</td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>object</code></td>
<td>No change</td>
<td>
<code>None</code> or <code>np.nan</code>
</td>
</tr>
<tr>
<td><code>integer</code></td>
<td>Cast to <code>float64</code>
</td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>boolean</code></td>
<td>Cast to <code>object</code>
</td>
<td>
<code>None</code> or <code>np.nan</code>
</td>
</tr>
</tbody>
</table>

Keep in mind that in Pandas, string data is always stored with an object dtype.

<ul>
<li>
<code>isnull()</code>: Generate a boolean mask indicating missing values</li>
<li>
<code>notnull()</code>: Opposite of <code>isnull()</code>
</li>
<li>
<code>dropna()</code>: Return a filtered version of the data</li>
<li>
<code>fillna()</code>: Return a copy of the data with missing values filled or imputed</li>
</ul>

In [384]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull() #return a mask, can be used to extract values using this mask

0    False
1     True
2    False
3     True
dtype: bool

In [385]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### Dropping null values

In [386]:
data.dropna()

0        1
2    hello
dtype: object

In [387]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6


We cannot drop single values from a DataFrame; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so dropna() gives a number of options for a DataFrame.
By default, dropna() will drop all rows in which any null value is present:

In [388]:
df.dropna() #by default remove all rows having NaN

     0    1  2
1  2.0  3.0  5

In [389]:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [390]:
df.dropna(axis = 1)

   2
0  2
1  5
2  6

But this drops some good data as well; you might rather be interested in dropping rows or columns with all NA values, or a majority of NA values. This can be specified through the how or thresh parameters, which allow fine control of the number of nulls to allow through.
The default is how='any', such that any row or column (depending on the axis keyword) containing a null value will be dropped. You can also specify how='all', which will only drop rows/columns that are all null values:

In [391]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [392]:
df.iloc[2,:]

0    NaN
1    4.0
2    6.0
3    NaN
Name: 2, dtype: float64

In [397]:
df.iloc[:,3] = 5
df

     0    1  2  3  a
0  1.0  NaN  2  5  5
1  2.0  3.0  5  5  5
2  NaN  4.0  6  5  5

In [398]:
df['a'] = 5 #Adding a column values are added in each row

In [399]:
df

     0    1  2  3  a
0  1.0  NaN  2  5  5
1  2.0  3.0  5  5  5
2  NaN  4.0  6  5  5

In [401]:
df[3,:] = 7
df

TypeError: unhashable type: 'slice'

In [402]:
df.iloc[3,:] = 7

IndexError: single positional indexer is out-of-bounds

In [405]:
df.iloc[2,:] = 79 #changing the current row

In [404]:
df

      0     1   2   3   a
0   1.0   NaN   2   5   5
1   2.0   3.0   5   5   5
2  79.0  79.0  79  79  79

In [406]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [411]:
?df.append
#can be used for appending rows

In [416]:
df.T
df = df.T

      0     1     2
0   1.0   2.0  79.0
1   NaN   3.0  79.0
2   2.0   5.0  79.0
3  88.0  88.0  88.0
a   5.0   5.0  79.0

In [417]:
df[3] = 88
df

      0     1     2   3
0   1.0   2.0  79.0  88
1   NaN   3.0  79.0  88
2   2.0   5.0  79.0  88
3  88.0  88.0  88.0  88
a   5.0   5.0  79.0  88

In [418]:
df.T

      0     1     2     3     a
0   1.0   NaN   2.0  88.0   5.0
1   2.0   3.0   5.0  88.0   5.0
2  79.0  79.0  79.0  88.0  79.0
3  88.0  88.0  88.0  88.0  88.0

In [419]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [421]:
df[3] = np.NaN

In [422]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [423]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

The default is how='any', such that any row or column (depending on the axis keyword) containing a null value will be dropped. You can also specify how='all', which will only drop rows/columns that are all null values:

For finer-grained control, the thresh parameter lets you specify a <b>minimum number of non-null</b> values for the row/column to be kept:

In [425]:
df.dropna(axis='rows', thresh=3)# minimum three non null value in a roe

     0    1  2   3
1  2.0  3.0  5 NaN


Here the first and last row have been dropped, because they contain only two non-null values.

In [427]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

#### Filling null values

Sometimes rather than dropping NA values, you'd rather replace them with a valid value. This value might be a single number like zero, or it might be some sort of imputation or interpolation from the good values. You could do this in-place using the isnull() method as a mask, but because it is such a common operation Pandas provides the fillna() method, which returns a copy of the array with the null values replaced.

In [428]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [430]:
data.fillna(0) #not inplace
data

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [434]:
data[data.isnull()] = 0.0 #inplace
data

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [435]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [436]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [437]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For DataFrames, the options are similar, but we can also specify an axis along which the fills take place:

In [438]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [440]:
df.fillna(method = 'ffill' , axis = 1)# column will be collapsed but when we go through elements of each row one by one then go to second row

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

Notice that if a previous value is not available during a forward fill, the NA value remains.

#### Hirarchical Indexing

Up to this point we've been focused primarily on one-dimensional and two-dimensional data, stored in Pandas Series and DataFrame objects, respectively. Often it is useful to go beyond this and store higher-dimensional datathat is, data indexed by more than one or two keys. While Pandas does provide Panel and Panel4D objects that natively handle three-dimensional and four-dimensional data (see Aside: Panel Data), a far more common pattern in practice is to make use of hierarchical indexing (also known as multi-indexing) to incorporate multiple index levels within a single index. In this way, higher-dimensional data can be compactly represented within the familiar one-dimensional Series and two-dimensional DataFrame objects.
In this section, we'll explore the direct creation of MultiIndex objects, considerations when indexing, slicing, and computing statistics across multiply indexed data, and useful routines for converting between simple and hierarchically indexed representations of your data.

#### A Multiply Indexed Series

Let's start by considering how we might represent two-dimensional data within a one-dimensional Series. For concreteness, we will consider a series of data where each point has a character and numerical key.

#### The bad way

In [534]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

With this indexing scheme, you can straightforwardly index or slice the series based on this multiple index:

In [535]:
pop[('California', 2000) : ('Texas', 2010)]

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

But the convenience ends there. For example, if you need to select all values from 2010, you'll need to do some messy (and potentially slow) munging to make it happen:

In [536]:
2000 in list(pop.index[0])

True

In [537]:
[i for i in pop.index if 2010 in list(i)]

[('California', 2010), ('New York', 2010), ('Texas', 2010)]

In [538]:
pop[i for i in pop.index if 2010 in list(i)]# do fancy indexing provide one more braces

SyntaxError: invalid syntax (<ipython-input-538-91244e6a277d>, line 1)

In [539]:
pop[[i for i in pop.index if 2010 in list(i)]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

#### The better way : Pandas MultiIndex

We can create a multi-index from the tuples as follows:

In [540]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

Notice that the MultiIndex contains multiple levels of indexingin this case, the state names and the years, as well as multiple labels for each data point which encode these levels.

If we re-index our series with this MultiIndex, we see the hierarchical representation of the data:

In [541]:
pop = pop.reindex(index)

In [542]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Here the first two columns of the Series representation show the multiple index values, while the third column shows the data. Notice that some entries are missing in the first column: in this multi-index representation, any blank entry indicates the same value as the line above it.


Now to access all data for which the second index is 2010, we can simply use the Pandas slicing notation

In [543]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

#### MultiIndex as extra dimension

You might notice something else here: we could easily have stored the same data using a simple DataFrame with index and column labels. In fact, Pandas is built with this equivalence in mind. The<b> unstack()</b> method will quickly convert a multiply indexed  Series into a conventionally indexed DataFrame:m

In [544]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [545]:
pop_df.stack() #provide opposite operation then unstack

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Seeing this, you might wonder why would we would bother with hierarchical indexing at all. The reason is simple: just as we were able to use multi-indexing to represent two-dimensional data within a one-dimensional Series, we can also use it to represent data of three or more dimensions in a Series or DataFrame. Each extra level in a multi-index represents an extra dimension of data; taking advantage of this property gives us much more flexibility in the types of data we can represent. Concretely, we might want to add another column of demographic data for each state at each year (say, population under 18) ; with a MultiIndex this is as easy as adding another column to the DataFrame:

In [546]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [547]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [548]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [549]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

#### Methods of MultiIndex Creation/

The most straightforward way to construct a multiply indexed Series or DataFrame is to simply pass a list of two or more index arrays to the constructor. For example:

In [550]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.348145  0.976031
  2  0.321064  0.371128
b 1  0.682977  0.794711
  2  0.807004  0.792278

The work of creating the MultiIndex is done in the background.

Similarly, if you pass a dictionary with appropriate tuples as keys, Pandas will automatically recognize this and use a MultiIndex by default:

In [551]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Explicit MultiIndexConstructor

you can construct the MultiIndex from a simple list of arrays giving the index values within each level:

In [552]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

You can construct it from a list of tuples giving the multiple index values of each point:

In [553]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])


You can even construct it from a Cartesian product of single indices:

In [554]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

Similarly, you can construct the MultiIndex directly using its internal encoding by passing levels (a list of lists containing available index values for each level) and labels (a list of lists that reference these labels):

In [555]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

Any of these objects can be passed as the index argument when creating a Series or Dataframe, or be passed to the reindex method of an existing Series or DataFrame.

#### Multiindex level names

Sometimes it is convenient to name the levels of the MultiIndex. This can be accomplished by passing the names argument to any of the above MultiIndex constructors, or by setting the names attribute of the index after the fact:

In [556]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64


With more involved datasets, this can be a useful way to keep track of the meaning of various index values.

#### Multiindex for columns

In a DataFrame, the rows and columns are completely symmetric, and just as the rows can have multiple levels of indices, the columns can have multiple levels as well. Consider the following, which is a mock-up of some (somewhat realistic) medical data:

In [557]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data

array([[ 1. ,  0.6, -0.5, -1. ,  1.4,  0.6],
       [ 0.1,  1.8,  0.5, -0.9,  1.5, -1.8],
       [-0.3, -0.4,  0.4, -0.2,  1.3,  0.2],
       [ 0.8,  0.4, -0.5,  0.6,  0.1,  1.3]])

In [558]:
data[:, ::2] *= 10
data += 37

In [559]:
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.6  32.0  36.0  51.0  37.6
     2      38.0  38.8  42.0  36.1  52.0  35.2
2014 1      34.0  36.6  41.0  36.8  50.0  37.2
     2      45.0  37.4  32.0  37.6  38.0  38.3


Here we see where the multi-indexing for both rows and columns can come in very handy. This is fundamentally four-dimensional data, where the dimensions are the subject, the measurement type, the year, and the visit number. With this in place we can, for example, index the top-level column by the person's name and get a full DataFrame containing just that person's information:

In [560]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      32.0  36.0
     2      42.0  36.1
2014 1      41.0  36.8
     2      32.0  37.6

For complicated records containing multiple labeled measurements across multiple times for many subjects (people, countries, cities, etc.) use of hierarchical rows and columns can be extremely convenient!

#### Indexing and Slicing MultiIndex

In [561]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [562]:
pop['California', 2000]

33871648

The MultiIndex also supports partial indexing, or indexing just one of the levels in the index. The result is another Series, with the lower-level indices maintained:

In [563]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

Partial slicing is available as well, as long as the MultiIndex is sorted (see discussion in Sorted and Unsorted Indices):

In [564]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [565]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

With sorted indices, partial indexing can be performed on lower levels by passing an empty slice in the first index:

In [566]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [567]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [568]:
pop[['California', 'Texas']]#fancy indexing

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Multiply indexed DataFrames

In [569]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.6  32.0  36.0  51.0  37.6
     2      38.0  38.8  42.0  36.1  52.0  35.2
2014 1      34.0  36.6  41.0  36.8  50.0  37.2
     2      45.0  37.4  32.0  37.6  38.0  38.3

Remember that columns are primary in a DataFrame, and the syntax used for multiply indexed Series applies to the columns. For example, we can recover Guido's heart rate data with a simple operation:

In [570]:
health_data['Guido', 'HR']

year  visit
2013  1        32.0
      2        42.0
2014  1        41.0
      2        32.0
Name: (Guido, HR), dtype: float64

In [571]:

health_data[health_data['Guido', 'HR'] > 36]#masking and extracting all rows

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 2      38.0  38.8  42.0  36.1  52.0  35.2
2014 1      34.0  36.6  41.0  36.8  50.0  37.2

In [572]:
health_data.loc[2013]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        47.0  37.6  32.0  36.0  51.0  37.6
2        38.0  38.8  42.0  36.1  52.0  35.2

In [573]:
health_data['HR']

KeyError: 'HR'

In [574]:
health_data['Bob']

type          HR  Temp
year visit
2013 1      47.0  37.6
     2      38.0  38.8
2014 1      34.0  36.6
     2      45.0  37.4

In [575]:
health_data[2013]

KeyError: 2013

In [576]:
health_data.loc[2013]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        47.0  37.6  32.0  36.0  51.0  37.6
2        38.0  38.8  42.0  36.1  52.0  35.2

In [577]:

health_data.loc[2013, 'Guido']

type     HR  Temp
visit
1      32.0  36.0
2      42.0  36.1

In [578]:
health_data.loc[2013, 'Guido']['Temp']

visit
1    36.0
2    36.1
Name: Temp, dtype: float64

Also, as with the single-index case, we can use the loc, iloc, and ix indexers introduced in Data Indexing and Selection. For example:

In [579]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      47.0  37.6
     2      38.0  38.8

These indexers provide an array-like view of the underlying two-dimensional data, but each individual index in loc or iloc can be passed a tuple of multiple indices. For example:

In [580]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        47.0
      2        38.0
2014  1        34.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [581]:
health_data['Bob', 'HR'] #by default things returns columns

year  visit
2013  1        47.0
      2        38.0
2014  1        34.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [582]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-582-fb34fa30ac09>, line 1)

You could get around this by building the desired slice explicitly using Python's built-in slice() function, but a better way in this context is to use an IndexSlice object, which Pandas provides for precisely this situation. For example:

In [583]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      47.0  32.0  51.0
2014 1      34.0  41.0  50.0

There are so many ways to interact with data in multiply indexed Series and DataFrames, and as with many tools in this book the best way to become famimliar with them is to try them out

#### Rearranging Multi-Indices

One of the keys to working with multiply indexed data is knowing how to effectively transform the data. There are a number of operations that will preserve all the information in the dataset, but rearrange it for the purposes of various computations. We saw a brief example of this in the stack() and unstack() methods, but there are many more ways to finely control the rearrangement of data between hierarchical indices and columns, and we'll explore them here.

#### Sorted and unsorted indices

In [584]:

index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.063412
      2      0.408344
c     1      0.695866
      2      0.227448
b     1      0.239314
      2      0.191046
dtype: float64

In [585]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

For various reasons, partial slices and other similar operations require the levels in the MultiIndex to be in sorted (i.e., lexographical) order. Pandas provides a number of convenience routines to perform this type of sorting; examples are the sort_index() and sortlevel() methods of the DataFrame. We'll use the simplest, sort_index(), here:

In [586]:
data = data.sort_index()
data

char  int
a     1      0.063412
      2      0.408344
b     1      0.239314
      2      0.191046
c     1      0.695866
      2      0.227448
dtype: float64

In [587]:
data['a':'b']

char  int
a     1      0.063412
      2      0.408344
b     1      0.239314
      2      0.191046
dtype: float64

#### Stacking and unstacking indecex

As we saw briefly before, it is possible to convert a dataset from a stacked multi-index to a simple two-dimensional representation, optionally specifying the level to use:

In [588]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [589]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [590]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

The opposite of unstack() is stack(), which here can be used to recover the original series:

In [591]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Index setting and resetting

Another way to rearrange hierarchical data is to turn the index labels into columns; this can be accomplished with the reset_index method. Calling this on the population dictionary will result in a DataFrame with a state and year column holding the information that was formerly in the index. For clarity, we can optionally specify the name of the data for the column representation:

In [593]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [592]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

Often when working with data in the real world, the raw input data looks like this and it's useful to build a MultiIndex from the column values. This can be done with the set_index method of the DataFrame, which returns a multiply indexed DataFrame:

In [594]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

#### Data Aggregations on Multi-indices

We've previously seen that Pandas has built-in data aggregation methods, such as mean(), sum(), and max(). For hierarchically indexed data, these can be passed a level parameter that controls which subset of the data the aggregate is computed on.
For example, let's return to our health data:

In [595]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  37.6  32.0  36.0  51.0  37.6
     2      38.0  38.8  42.0  36.1  52.0  35.2
2014 1      34.0  36.6  41.0  36.8  50.0  37.2
     2      45.0  37.4  32.0  37.6  38.0  38.3

In [596]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     42.5  38.2  37.0  36.05  51.5  36.40
2014     39.5  37.0  36.5  37.20  44.0  37.75

By further making use of the axis keyword, we can take the mean among levels on the columns as well:By further making use of the axis keyword, we can take the mean among levels on the columns as well:m

In [598]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  43.666667  36.883333
2014  40.000000  37.316667

Pandas has a few other fundamental data structures that we have not yet discussed, namely the pd.Panel and pd.Panel4D objects. These can be thought of, respectively, as three-dimensional and four-dimensional generalizations of the (one-dimensional) Series and (two-dimensional) DataFrame structures.

#### Combining Datasets: Concat and Append

Here we'll take a look at simple concatenation of Series and DataFrames with the pd.concat function; later we'll dive into more sophisticated in-memory merges and joins implemented in Pandas.

In [599]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In addition, we'll create a quick class that allows us to display multiple DataFrames side by side. The code makes use of the special _repr_html_ method, which IPython uses to implement its rich object display:

In [600]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

Concatenation of Series and DataFrame objects is very similar to concatenation of Numpy arrays, which can be done via the np.concatenate function as discussed in The Basics of NumPy Arrays.

In [602]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])
x + y + z

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [603]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

pd.concat() can be used for a simple concatenation of Series or DataFrame objects, just as np.concatenate() can be used for simple concatenations of arrays:

In [604]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [605]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

By default, the concatenation takes place row-wise within the DataFrame (i.e., axis=0). Like np.concatenate, pd.concat allows specification of an axis along which concatenation will take place. Consider the following example:

In [607]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

If you'd like to simply verify that the indices in the result of pd.concat() do not overlap, you can specify the verify_integrity flag. With this set to True, the concatenation will raise an exception if there are duplicate indices. Here is an example, where for clarity we'll catch and print the error message:

In [610]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

Notice the repeated indices in the result. While this is valid within DataFrames, the outcome is often undesirable. pd.concat() gives us a few ways to handle it.

In [611]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

Sometimes the index itself does not matter, and you would prefer it to simply be ignored. This option can be specified using the ignore_index flag. With this set to true, the concatenation will create a new integer index for the resulting Series:

In [612]:
display('x', 'y', 'pd.concat([x, y], ignore_index=True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

#### Adding MultiIndex Keys

Another option is to use the keys option to specify a label for the data sources; the result will be a hierarchically indexed series containing the data:

In [613]:
display('x', 'y', "pd.concat([x, y], keys=['x', 'y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], keys=['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

#### Concatenation with joins

In the simple examples we just looked at, we were mainly concatenating DataFrames with shared column names. In practice, data from different sources might have different sets of column names, and pd.concat offers several options in this case. Consider the concatenation of the following two DataFrames, which have some (but not all!) columns in common:

In [614]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])')

/home/abhash/.local/lib/python3.5/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

By default, the entries for which no data is available are filled with NA values. To change this, we can specify one of several options for the join and join_axes parameters of the concatenate function. By default, the join is a union of the input columns (join='outer'), but we can change this to an intersection of the columns using join='inner':

In [615]:
display('df5', 'df6',
        "pd.concat([df5, df6], join='inner')")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

Another option is to directly specify the index of the remaininig colums using the join_axes argument, which takes a list of index objects. Here we'll specify that the returned columns should be the same as those of the first input:

In [616]:
display('df5', 'df6',
        "pd.concat([df5, df6], join_axes=[df5.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

#### The append method

Because direct array concatenation is so common, Series and DataFrame objects have an append method that can accomplish the same thing in fewer keystrokes. For example, rather than calling pd.concat([df1, df2]), you can simply call df1.append(df2):

In [617]:
display('df1', 'df2', 'df1.append(df2)')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

df1.append(df2)
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

Keep in mind that unlike the append() and extend() methods of Python lists, the append() method in Pandas does not modify the original objectinstead it creates a new object with the combined data. It also is not a very efficient method, because it involves creation of a new index and data buffer.<b> Thus, if you plan to do multiple append operations, it is generally better to build a list of DataFrames and pass them all at once to the concat() function.</b>

#### Combining Datasets: Merge and Join

One essential feature offered by Pandas is its high-performance, in-memory join and merge operations. If you have ever worked with databases, you should be familiar with this type of data interaction. The main interface for this is the pd.merge function, and we'll see few examples of how this can work in practice.

In [618]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

#### Categories of Joins

The pd.merge() function implements a number of types of joins: the one-to-one, many-to-one, and many-to-many joins. All three types of joins are accessed via an identical call to the pd.merge() interface; the type of join performed depends on the form of the input data. Here we will show simple examples of the three types of merges, and discuss detailed options further below.

#### One-to-one joins

In [619]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [621]:
df3 = pd.merge(df1, df2)#see what kind of result we would have got concat and inner join
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [622]:
df_check = pd.concat([df1,df2], join = 'inner')

In [623]:
df_check

  employee
0      Bob
1     Jake
2     Lisa
3      Sue
0     Lisa
1      Bob
2     Jake
3      Sue

In [628]:
df1.columns

Index(['employee', 'group'], dtype='object')

In [630]:
pd.concat([df1,df2], join_axes = [pd.Index(['employee','group','hire_date'])])

  employee        group  hire_date
0      Bob   Accounting        NaN
1     Jake  Engineering        NaN
2     Lisa  Engineering        NaN
3      Sue           HR        NaN
0     Lisa          NaN     2004.0
1      Bob          NaN     2008.0
2     Jake          NaN     2012.0
3      Sue          NaN     2014.0

The pd.merge() function recognizes that each DataFrame has an "employee" column, and automatically joins using this column as a key. The result of the merge is a new DataFrame that combines the information from the two inputs. Notice that the order of entries in each column is not necessarily maintained: in this case, the order of the "employee" column differs between df1 and df2, and the pd.merge() function correctly accounts for this. <b>Additionally, keep in mind that the merge in general discards the index, except in the special case of merges by index (see the left_index and right_index keywords, discussed momentarily).</b>

#### Many to one join

In [631]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### Many to many join

In [632]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

#### Specification of the Merge Key

#### The on keyword

In [634]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

Most simply, you can explicitly specify the name of the key column using the on keyword, which takes a column name or a list of column names:`

This option works only if both the left and right DataFrames have the specified column name.

<h5> the left_on and right_on keywords</h5>

At times you may wish to merge two datasets with different column names; for example, we may have a dataset in which the employee name is labeled as "name" rather than "employee". In this case, we can use the left_on and right_on keywords to specify the two column names:

In [635]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

The result has a redundant column(name and employee here same) that we can drop if desiredfor example, by using the drop() method of DataFrames:

In [636]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### The left_index and right_index keywords

Sometimes, rather than merging on a column, you would instead like to merge on an index. For example, your data might look like this:

setting the column employee as index in both data frame

In [638]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [639]:
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

For convenience, DataFrames implement the join() method, which performs a merge that defaults to joining on indices:

In [640]:
display('df1a', 'df2a', 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

The left join and right join return joins over the left entries and right entries, respectively. For example:

In [642]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7)')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7)
   name   food drink
0  Mary  bread  wine

In [643]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [644]:
display('df6', 'df7', "pd.merge(df6, df7, how='outer')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='outer')
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [645]:
display('df6', 'df7', "pd.merge(df6, df7, how='left')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='left')
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine


The output rows now correspond to the entries in the left input. Using how='right' works in a similar manner.
All of these options can be applied straightforwardly to any of the preceding join types.

#### Overlapping Column Names: The suffixes Keyword


Finally, you may end up in a case where your two input DataFrames have conflicting column names. Consider this example:m

In [647]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Because the output would have two conflicting column names, the merge function automatically appends a suffix _x or _y to make the output columns unique. If these defaults are inappropriate, it is possible to specify a custom suffix using the suffixes keyword:

In [648]:
display('df8', 'df9', 'pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [649]:
!ls

BicycleWeather.csv    Numpy_and_Pandas.ipynb  Seattle2014.csv
data-USstates-master  Pandas_jake.ipynb       untitled.txt
Kaggle_dataquest      president_heights.csv

In [666]:

# Following are shell commands to download the data
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

In [650]:
pop = pd.read_csv('data-USstates-master/state-population.csv')
areas = pd.read_csv('data-USstates-master/state-areas.csv')
abbrevs = pd.read_csv('data-USstates-master/state-abbrevs.csv')

display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [664]:
def display_result(*dataframe_list):
    for i in dataframe_list:
        print(i)

In [665]:
dataframe_list = [pop.head(),areas.head(),abbrevs.head()]
display_result(*dataframe_list)

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [669]:
merged_ar_abb = pd.merge(areas,abbrevs, on = 'state')
merged_ar_abb

                   state  area (sq. mi) abbreviation
0                Alabama          52423           AL
1                 Alaska         656425           AK
2                Arizona         114006           AZ
3               Arkansas          53182           AR
4             California         163707           CA
5               Colorado         104100           CO
6            Connecticut           5544           CT
7               Delaware           1954           DE
8                Florida          65758           FL
9                Georgia          59441           GA
10                Hawaii          10932           HI
11                 Idaho          83574           ID
12              Illinois          57918           IL
13               Indiana          36420           IN
14                  Iowa          56276           IA
15                Kansas          82282           KS
16              Kentucky          40411           KY
17             Louisiana          51843           LA
18                 Maine          35387           ME
19              Maryland          12407           MD
20         Massachusetts          10555           MA
21              Michigan          96810           MI
22             Minnesota          86943           MN
23           Mississippi          48434           MS
24              Missouri          69709           MO
25               Montana         147046           MT
26              Nebraska          77358           NE
27                Nevada         110567           NV
28         New Hampshire           9351           NH
29            New Jersey           8722           NJ
30            New Mexico         121593           NM
31              New York          54475           NY
32        North Carolina          53821           NC
33          North Dakota          70704           ND
34                  Ohio          44828           OH
35              Oklahoma          69903           OK
36                Oregon          98386           OR
37          Pennsylvania          46058           PA
38          Rhode Island           1545           RI
39        South Carolina          32007           SC
40          South Dakota          77121           SD
41             Tennessee          42146           TN
42                 Texas         268601           TX
43                  Utah          84904           UT
44               Vermont           9615           VT
45              Virginia          42769           VA
46            Washington          71303           WA
47         West Virginia          24231           WV
48             Wisconsin          65503           WI
49               Wyoming          97818           WY
50  District of Columbia             68           DC

In [673]:
mer_res_pop = pd.merge(merged_ar_abb, pop  , left_on = 'abbreviation', right_on =  r'state/region')

In [682]:
mer_res_pop  = mer_res_pop.drop(r'state/region' ,axis = 1)

In [683]:
mer_res_pop

,state,area (sq. mi),abbreviation,ages,year,population
0,Alabama,52423,AL,under18,2012,1117489.0
1,Alabama,52423,AL,total,2012,4817528.0
2,Alabama,52423,AL,under18,2010,1130966.0
3,Alabama,52423,AL,total,2010,4785570.0
4,Alabama,52423,AL,under18,2011,1125763.0
5,Alabama,52423,AL,total,2011,4801627.0
6,Alabama,52423,AL,total,2009,4757938.0
7,Alabama,52423,AL,under18,2009,1134192.0
8,Alabama,52423,AL,under18,2013,1111481.0
9,Alabama,52423,AL,total,2013,4833722.0
10,Alabama,52423,AL,total,2007,4672840.0
11,Alabama,52423,AL,under18,2007,1132296.0
12,Alabama,52423,AL,total,2008,4718206.0
13,Alabama,52423,AL,under18,2008,1134927.0
14,Alabama,52423,AL,total,2005,4569805.0
15,Alabama,52423,AL,under18,2005,1117229.0
16,Alabama,52423,AL,total,2006,4628981.0
17,Alabama,52423,AL,under18,2006,1126798.0
18,Alabama,52423,AL,total,2004,4530729.0
19,Alabama,52423,AL,under18,2004,1113662.0
20,Alabama,52423,AL,total,2003,4503491.0
21,Alabama,52423,AL,under18,2003,1113083.0
22,Alabama,52423,AL,total,2001,4467634.0
23,Alabama,52423,AL,under18,2001,1120409.0
24,Alabama,52423,AL,total,2002,4480089.0
25,Alabama,52423,AL,under18,2002,1116590.0
26,Alabama,52423,AL,under18,1999,1121287.0
27,Alabama,52423,AL,total,1999,4430141.0
28,Alabama,52423,AL,total,2000,4452173.0
29,Alabama,52423,AL,under18,2000,1122273.0
...,...,...,...,...,...,...
2418,District of Columbia,68,DC,total,2003,568502.0
2419,District of Columbia,68,DC,under18,2003,111403.0
2420,District of Columbia,68,DC,total,2004,567754.0
2421,District of Columbia,68,DC,under18,2004,109756.0
2422,District of Columbia,68,DC,total,2001,574504.0
2423,District of Columbia,68,DC,under18,2001,114625.0
2424,District of Columbia,68,DC,total,2002,573158.0
2425,District of Columbia,68,DC,under18,2002,113822.0
2426,District of Columbia,68,DC,total,1999,570220.0
2427,District of Columbia,68,DC,under18,1999,115003.0
2428,District of Columbia,68,DC,total,2000,572046.0
2429,District of Columbia,68,DC,under18,2000,114503.0
2430,District of Columbia,68,DC,under18,1998,113839.0
2431,District of Columbia,68,DC,total,1998,565232.0
2432,District of Columbia,68,DC,under18,1997,119531.0
2433,District of Columbia,68,DC,total,1997,567739.0
2434,District of Columbia,68,DC,under18,1996,121210.0
2435,District of Columbia,68,DC,total,1996,572379.0
2436,District of Columbia,68,DC,total,1995,580519.0
2437,District of Columbia,68,DC,under18,1995,123620.0
2438,District of Columbia,68,DC,total,1993,595302.0
2439,District of Columbia,68,DC,under18,1993,120471.0
2440,District of Columbia,68,DC,under18,1994,122170.0
2441,District of Columbia,68,DC,total,1994,589240.0
2442,District of Columbia,68,DC,total,1991,600870.0
2443,District of Columbia,68,DC,under18,1991,116825.0
2444,District of Columbia,68,DC,under18,1992,118636.0
2445,District of Columbia,68,DC,total,1992,597567.0
2446,District of Columbia,68,DC,under18,1990,112632.0
2447,District of Columbia,68,DC,total,1990,605321.0

In [688]:
mer_res_pop_2010 = mer_res_pop[mer_res_pop['year'] == 2010]

In [689]:
mer_res_pop_2010.columns

Index(['state', 'area (sq. mi)', 'abbreviation', 'ages', 'year', 'population'], dtype='object')

In [690]:
mer_res_pop_2010['density'] = mer_res_pop_2010['population'] / mer_res_pop_2010[r'area (sq. mi)']

/home/abhash/.local/lib/python3.5/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [691]:
mer_res_pop_2010.columns

Index(['state', 'area (sq. mi)', 'abbreviation', 'ages', 'year', 'population',
       'density'],
      dtype='object')

In [693]:
mer_res_pop_2010.sort_values(by='density' , ascending = False, inplace = True)

/home/abhash/.local/lib/python3.5/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [694]:
mer_res_pop_2010.head()

,state,area (sq. mi),abbreviation,ages,year,population,density
2405,District of Columbia,68,DC,total,2010,605125.0,8898.897059
2404,District of Columbia,68,DC,under18,2010,101309.0,1489.838235
1397,New Jersey,8722,NJ,total,2010,8802707.0,1009.253268
1866,Rhode Island,1545,RI,total,2010,1052669.0,681.339159
293,Connecticut,5544,CT,total,2010,3579210.0,645.600649

In [696]:
merged_checker1 = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged_checker1.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [701]:
merged_checker2 = pd.merge(pop, abbrevs, 
                  left_on='state/region', right_on='abbreviation')
merged_checker2.head()
merged_checker1.head()

merged_checker1.shape
merged_checker2.shape

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

(2544, 6)

(2448, 6)

In [702]:
merged_checker1.isnull().any()
merged_checker2.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
abbreviation     True
dtype: bool

state/region    False
ages            False
year            False
population      False
state           False
abbreviation    False
dtype: bool

In [703]:
np.sum(merged_checker1.isnull())

state/region     0
ages             0
year             0
population      20
state           96
abbreviation    96
dtype: int64

In [705]:
merged_checker1 = merged_checker1.drop('abbreviation', 1)

In [706]:
np.sum(merged_checker1.isnull())

state/region     0
ages             0
year             0
population      20
state           96
dtype: int64

In [708]:
merged_checker1[merged_checker1['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [711]:
merged_checker1.loc[merged_checker1['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [716]:
merged_checker1.describe()

              year    population
count  2544.000000  2.524000e+03
mean   2001.500000  6.805558e+06
std       6.923547  2.855014e+07
min    1990.000000  1.013090e+05
25%    1995.750000  7.423805e+05
50%    2001.500000  1.597005e+06
75%    2007.250000  4.547104e+06
max    2013.000000  3.161288e+08

In [717]:
merged_checker1.loc[merged_checker1['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged_checker1.loc[merged_checker1['state/region'] == 'USA', 'state'] = 'United States'

In [718]:
final = pd.merge(merged_checker1, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [719]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [720]:

final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [721]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [722]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [723]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [724]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

#### Aggregation and grouping

In [725]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [727]:
planets.head()
planets.index
planets.columns

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

RangeIndex(start=0, stop=1035, step=1)

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [729]:
planets.isnull().any()

method            False
number            False
orbital_period     True
mass               True
distance           True
year              False
dtype: bool

In [730]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [732]:
planets[planets['distance'].isnull()]

,method,number,orbital_period,mass,distance,year
32,Eclipse Timing Variations,1,10220.000000,6.050,NaN,2009
33,Imaging,1,NaN,NaN,NaN,2008
41,Eclipse Timing Variations,1,2900.000000,NaN,NaN,2011
42,Eclipse Timing Variations,1,4343.500000,4.200,NaN,2012
43,Eclipse Timing Variations,2,5840.000000,NaN,NaN,2011
44,Eclipse Timing Variations,2,1916.250000,NaN,NaN,2011
77,Radial Velocity,1,714.300000,10.600,NaN,2007
85,Radial Velocity,2,379.630000,21.420,NaN,2009
86,Radial Velocity,2,621.990000,12.470,NaN,2009
87,Radial Velocity,1,578.200000,NaN,NaN,2012
88,Radial Velocity,1,392.600000,0.910,NaN,2011
90,Imaging,1,NaN,NaN,NaN,2006
91,Transit,1,1.508956,NaN,NaN,2008
94,Transit,1,9.202050,NaN,NaN,2008
95,Transit,1,4.037896,NaN,NaN,2009
96,Transit,1,8.886593,NaN,NaN,2009
112,Transit,1,3.575320,NaN,NaN,2014
146,Transit,1,1.580405,NaN,NaN,2009
255,Radial Velocity,1,359.900000,4.600,NaN,2007
355,Radial Velocity,1,851.800000,6.100,NaN,2007
532,Radial Velocity,1,538.000000,1.830,NaN,2007
608,Radial Velocity,1,2093.300000,NaN,NaN,2012
618,Radial Velocity,1,192.000000,6.575,NaN,2013
619,Radial Velocity,1,501.750000,6.900,NaN,2009
655,Transit,1,3.548460,NaN,NaN,2009
656,Transit,1,3.234723,NaN,NaN,2009
657,Transit,1,4.885525,NaN,NaN,2009
671,Transit,1,1.763589,NaN,NaN,2011
673,Transit,1,4.942782,NaN,NaN,2011
676,Transit,3,3.504725,NaN,NaN,2011
...,...,...,...,...,...,...
931,Transit,1,1.211919,NaN,NaN,2002
932,Transit,1,4.016100,NaN,NaN,2004
935,Transit,1,3.979100,NaN,NaN,2007
936,Transit,1,3.677240,NaN,NaN,2007
937,Imaging,1,730000.000000,NaN,NaN,2006
939,Radial Velocity,1,4.426400,NaN,NaN,2012
940,Radial Velocity,1,2.145100,NaN,NaN,2012
941,Pulsar Timing,3,25.262000,NaN,NaN,1992
942,Pulsar Timing,3,66.541900,NaN,NaN,1992
943,Pulsar Timing,3,98.211400,NaN,NaN,1994
944,Pulsar Timing,1,36525.000000,NaN,NaN,2003
946,Transit,1,1.420033,NaN,NaN,2010
947,Transit,1,1.337118,NaN,NaN,2011
950,Imaging,1,NaN,NaN,NaN,2010
957,Imaging,1,NaN,NaN,NaN,2008
958,Pulsation Timing Variations,1,1170.000000,NaN,NaN,2007
964,Transit,1,3.361006,NaN,NaN,2009
969,Transit,1,1.091423,NaN,NaN,2008
972,Transit,1,3.752066,NaN,NaN,2009
973,Transit,1,3.118601,NaN,NaN,2009
979,Transit,1,2.944426,NaN,NaN,2010
980,Transit,1,2.341212,NaN,NaN,2010
981,Transit,1,3.764825,NaN,NaN,2010
983,Transit,1,3.408821,NaN,NaN,2010
986,Transit,1,2.718659,NaN,NaN,2010
989,Transit,1,3.161575,NaN,NaN,2011
997,Transit,1,2.423804,NaN,NaN,2011
998,Transit,1,3.126088,NaN,NaN,2011
999,Transit,1,1.430370,NaN,NaN,2011
1001,Transit,1,2.143634,NaN,NaN,2011

In [733]:

rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [734]:
ser.sum()

2.811925491708157

For a DataFrame, by default the aggregates return results within each column:

In [736]:

df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [737]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [738]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [739]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

<table>
<thead>
<tr>
<th>Aggregation</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>count()</code></td>
<td>Total number of items</td>
</tr>
<tr>
<td>
<code>first()</code>, <code>last()</code>
</td>
<td>First and last item</td>
</tr>
<tr>
<td>
<code>mean()</code>, <code>median()</code>
</td>
<td>Mean and median</td>
</tr>
<tr>
<td>
<code>min()</code>, <code>max()</code>
</td>
<td>Minimum and maximum</td>
</tr>
<tr>
<td>
<code>std()</code>, <code>var()</code>
</td>
<td>Standard deviation and variance</td>
</tr>
<tr>
<td><code>mad()</code></td>
<td>Mean absolute deviation</td>
</tr>
<tr>
<td><code>prod()</code></td>
<td>Product of all items</td>
</tr>
<tr>
<td><code>sum()</code></td>
<td>Sum of all items</td>
</tr>
</tbody>
</table>

#### GroupBy: Split, Apply, Combine

<p><img src="//github.com/jakevdp/PythonDataScienceHandbook/raw/599aa0fe3f882c0001670e676e5a8d43b92c35fc/notebooks/figures/03.08-split-apply-combine.png" alt="">
<a href="06.00-Figure-Code.ipynb#Split-Apply-Combine">figure source in Appendix</a></p>


This makes clear what the groupby accomplishes:
The split step involves breaking up and grouping a DataFrame depending on the value of the specified key.
The apply step involves computing some function, usually an aggregate, transformation, or filtering, within the individual groups.
The combine step merges the results of these operations into an output array.

In [740]:

df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

The most basic split-apply-combine operation can be computed with the groupby() method of DataFrames, passing the name of the desired key column:

In [741]:
df.groupby('key')

In [762]:

df_ = df.groupby('key').sum()
df_

     data
key
A       3
B       5
C       7

In [758]:
df_.reindex?

In [763]:
df_.reset_index()

  key  data
0   A     3
1   B     5
2   C     7


Column indexing : 
The GroupBy object supports column indexing in the same way as the DataFrame, and returns a modified GroupBy object. For example:

In [764]:
planets.groupby('method')

planets.groupby('method')['orbital_period']

In [765]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

#### Iteration over group

In [766]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

#### Dispatch method

In [770]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [771]:

rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

#### Aggregation

We're now familiar with GroupBy aggregations with sum(), median(), and the like, but the aggregate() method allows for even more flexibility. It can take a string, a function, or a list thereof, and compute all the aggregates at once. Here is a quick example combining all these:

In [772]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [773]:

df.groupby('key').aggregate({'data1': 'min',
                             'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

#### Filtering

A filtering operation allows you to drop data based on the group properties. For example, we might want to keep all groups in which the standard deviation is larger than some critical value:

In [775]:
def filter_func(x):
    return x['data2'].std() > 4

display('df', "df.groupby('key').std()", "df.groupby('key').filter(filter_func)")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby('key').std()
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

df.groupby('key').filter(filter_func)
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [776]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

#### Transformation

In [777]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

#### The apply method

In [778]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

display('df', "df.groupby('key').apply(norm_by_data2)")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby('key').apply(norm_by_data2)
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [779]:
L = [0, 1, 0, 1, 2, 0]
display('df', 'df.groupby(L).sum()')

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby(L).sum()
   data1  data2
0      7     17
1      4      3
2      4      7

In [780]:
display('df', "df.groupby(df['key']).sum()")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby(df['key']).sum()
     data1  data2
key
A        3      8
B        5      7
C        7     12

In [781]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
display('df2', 'df2.groupby(mapping).sum()')

df2
     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

df2.groupby(mapping).sum()
           data1  data2
consonant     12     19
vowel          3      8

Another method is to provide a dictionary that maps index values to the group keys:

In [783]:
display('df2', 'df2.groupby(str.lower).mean()')#inputing index value

df2
     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

df2.groupby(str.lower).mean()
   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [784]:
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0